package com.example.data.db

import com.example.common.QuestionInfoDB

object QuestionsForAddToDBService {
    val listOfEasyQuestionsInfo = listOf(
        QuestionInfoDB(
            0L,
            "Что надевают на руки в боксе и их две?",
            "Перчатки",
            "Варежки",
            "Лосины",
            "Носки",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Что используют как тяжесть для зарядки?",
            "Гантелю",
            "Трёхтомник",
            "Стулья",
            "Пауэрбанку",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Другое название настольного тенниса – это",
            "Пинг-понг",
            "Тик-ток",
            "Тики-так",
            "Walk-talk",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Как называют спортивный снаряд-животное?",
            "Козёл",
            "Баран",
            "Бык",
            "Заяц",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Что обеспечивает безопасность голове спортсмена?",
            "Шлем",
            "Роспись в журнале ТБ",
            "Шапка-ушанка",
            "Волосы",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Как называется бросок в ворота?",
            "Гол",
            "Пас",
            "Аут",
            "Брек",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Кто не играет в хоккей?",
            "Трус",
            "Балбес",
            "Бывалый",
            "Шурик",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Доска для спуска со снежного склона называется",
            "Сноуборд",
            "Скейтборд",
            "Лонгборд",
            "Круизер",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Атлетика бывает 2 видов. Каких?",
            "Лёгкая и тяжёлая",
            "Средняя",
            "Средняя и тяжелая",
            "Легкая и средняя",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Из какого овоща стреляют в спорте?",
            "Из лука",
            "Из морковки",
            "Из кабачка",
            "Из редиски",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Чем отбивают мяч в бейсболе?",
            "Битой",
            "Рукой",
            "Перчаткой",
            "Головой",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Зачем обливаются холодной водой?",
            "Закаливание",
            "Затаривание",
            "Закольцовывание",
            "Замораживание",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Чего не надо, если есть сила?",
            "Ума",
            "Ясности",
            "Воды",
            "Воздуха",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Спортивный снаряд для перетягивания",
            "Канат",
            "Одеяло",
            "Нитка",
            "Веревка",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Как называется самый центр мишени в стрельбе из лука или дартсе?",
            "Яблочко",
            "Грушка",
            "Персик",
            "Томат",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Когда олимпийский спортсмен занимает первое место, медаль какого цвета он получает?",
            "Золото",
            "Серебро",
            "Бронза",
            "Чугун",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Такого наказания нет в хоккее на льду",
            "Конфискация клюшки",
            "Большой штраф",
            "Удаление до конца игры",
            "Малый штраф",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Игрокам запрещено выходить без шлема на",
            "Хоккейное поле",
            "Баскетбольное",
            "Футбольное",
            "Волейбольное",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "В бадминтоне используется",
            "Волан",
            "Мяч",
            "Клюшка",
            "Молоток",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Какая шахматная фигура ходит буквой \"Г\"?",
            "Конь",
            "Ферзь",
            "Король",
            "Слон",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Каких птиц традиционно выпускают на открытии Олимпийских игр?",
            "Голуби",
            "Куры",
            "Павлины",
            "Снегири",
            "Easy"
        )
    )

    val listOfNormalQuestionsInfo = listOf(
        QuestionInfoDB(
            0L,
            "Сколько колец у символа Олимпиады?",
            "5",
            "4",
            "7",
            "8",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Вид спорта, где надо ехать на лыжах и стрелять из винтовки, это",
            "Биатлон",
            "Триатлон",
            "Дуатлон",
            "Акватлон",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Эта игра похожа на бейсбол. Какая?",
            "Русская лапта",
            "Кёрлинг",
            "Гольф",
            "Боулинг",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Где зажигают олимпийский факел?",
            "В Греции",
            "В Македонии",
            "В Болгарии",
            "В Италии",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Название теннисной площадки",
            "Корт",
            "Каток",
            "Стадион",
            "Поле",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Как называется обувь футболиста?",
            "Бутсы",
            "Кеды",
            "Кроссовки",
            "Ботинки",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Водный вид спорта с мячом – это",
            "Водное поло",
            "Яхтинг",
            "Поло",
            "Синхронное плавание",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Чем забрасывают мяч в гандболе?",
            "Рукой",
            "Ногой",
            "Головой",
            "Битой",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "В какой игре пользуются самым легким мячом?",
            "Настольном теннисе",
            "Большой теннис",
            "Волейбол",
            "Футбол",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "В какой игре используются мяч наибольшей величины",
            "Баскетбол",
            "Волейбол",
            "Футбол",
            "Теннис",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Начиная с 1924 года к словам «Олимпийские игры» стали добавлять ещё одно то или иное слово. Какое?",
            "Летние или зимние",
            "Всемирные и континентальные",
            "Весенние и осенние",
            "Морские и воздушные",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Чем награждали победителей Игр в Древней Греции?",
            "Венком из листьев лавра",
            "Золотой медалью",
            "Бронзовым кубком",
            "Грамотой",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "На открытии Олимпийских игр команды идут в порядке алфавита страны-организатора. Но впереди всегда шествует команда одной и той же страны. Какой?",
            "Греции",
            "Румынии",
            "Македонии",
            "Словакии",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Сколько дисциплин в мужской гимнастике?",
            "Шесть – прыжок, кольца, пол, перекладина, брусья, конь",
            "Пять - прыжок, кольца, пол, перекладина, брусья",
            "Четыре - пол, перекладина, брусья, конь",
            "Три - кольца, пол, перекладина",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Какая часть тела в футболе не может касаться мяча?",
            "Руки",
            "Ноги",
            "Голова",
            "Тело",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Где проходили первые античные Олимпийские игры?",
            "В Греции",
            "В Македонии",
            "В Древнем Риме",
            "В Персии",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Самый тяжёлый мяч – это",
            "Баскетбольный",
            "Футбольный",
            "Волейбольный",
            "Теннисный",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "В какой стране проходили зимние олимпийские игры в 2014 году?",
            "Россия",
            "Китай",
            "Франция",
            "Германия",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Хоккей с шайбой появился в",
            "Канаде",
            "Швеции",
            "Финляндии",
            "Норвегии",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Родиной футбола является",
            "Англия",
            "Голландия",
            "Франция",
            "Германия",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Олимпиада, символом которой стал Мишка, проходила в Москве в",
            "1980 году",
            "1975 году",
            "1985 году",
            "1970 году",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Шахматы появились в той стране",
            "Индии",
            "Персии",
            "Китае",
            "Турции",
            "Normal"
        )
    )

    val listOfHardQuestionsInfo = listOf(
        QuestionInfoDB(
            0L,
            "Какой промежуток времени между зимними олимпиадами?",
            "4 года",
            "3 года",
            "2 года",
            "1 год",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Количество игроков в футбольной команде?",
            "11",
            "12",
            "10",
            "14",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какое количество игроков в волейбольной команде?",
            "6",
            "5",
            "7",
            "4",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Что значит эмблема олимпийских игр?",
            "Символ дружбы континентов",
            "Символ веры в спорт",
            "Символ победы",
            "Символ единства",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Высокие носки у футболистов называются?",
            "Гетры",
            "Чулки",
            "Колготки",
            "Гольфы",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Откуда прыгает лыжник во фристайле?",
            "Трамплин",
            "Гора",
            "Самолёт",
            "Вертолёт",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Как называется штрафной бросок в хоккее?",
            "Буллит",
            "Пенальти",
            "Пас",
            "Подкидка",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Как называется вид спорта, где спортсмены на лыжах делают трюки в воздухе?",
            "Фристайл",
            "Биатлон",
            "Лажная гонка",
            "Слалом",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какой девиз у Олимпийских игр?",
            "Быстрее. Выше. Сильнее.",
            "Горячие. Жаркие. Твои.",
            "Предолеть себя",
            "Лучше. Круче. Интереснее.",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Из какого вида спорта «пелотон»?",
            "Велоспорт",
            "Лыжный спорт",
            "Водный спорт",
            "Автомобильный спорт",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "В этой стране началось регби. В какой?",
            "Англия",
            "Мексика",
            "Голландия",
            "Испания",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько весит мяч для гольфа?",
            "41-46 грамм",
            "41 грамм",
            "46 грамм",
            "40-47 грамм",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Когда основали айкидо?",
            "1925",
            "1930",
            "1920",
            "1935",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Мяч вне игры.",
            "Аут",
            "Пас",
            "Фол",
            "Буллит",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Передача мяча в игре.",
            "Пас",
            "Аут",
            "Фол",
            "Буллит",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какова длина марафонской дистанции?",
            "42195 метров",
            "42000 метров",
            "42295 метров",
            "42145 метров",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто был основателем современных олимпийских игр?",
            "Пьер де Кубертэн",
            "Джеймс Кутте",
            "Стив Мисилье",
            "Флоренс Маснада",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какая длина беговой дорожки на спортивном стадионе?",
            "400 метров",
            "450 метров",
            "480 метров",
            "500 метров",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "В каком году прошли 1 зимние Олимпийские игры?",
            "В 1924 году, Шамони, Франция",
            "В 1929 году, Париж, Франция",
            "В 1920 году, Мюнхен, Германия",
            "В 1927 году, Салоники, Греция",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какая единственная страна принимала участие во всех чемпионатах мира по футболу?",
            "Бразилия",
            "Аргентина",
            "Канада",
            "Испания",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Что за гонка Тур де Франс?",
            "Велогонка",
            "Автогонка",
            "Лыжная гонка",
            "Потогонка",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какая африканская страна первой получила право на участие в чемпионате мира?",
            "Египет",
            "Ливия",
            "Сирия",
            "Кувейт",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто был первым британским игроком, выигравшим чемпионские титулы в четырех странах?",
            "Дэвид Бекхэм",
            "Лионель Месси",
            "Криштиану Роналду",
            "Пеле",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Открытый чемпионат Франции по теннису проводится на стадионе, названном в честь какого пилота времен Первой мировой войны?",
            "Ролан Гаррос",
            "Рене Поль Фонк",
            "Жорж Мадон",
            "Шарль Нунжессер",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какой город первым дважды принимал Олимпиаду?",
            "Париж",
            "Берлин",
            "Лондон",
            "Рим",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какое последнее соревнование в десятиборье?",
            "Бег на 1500 метров",
            "Бег на 1000 метров",
            "Бег на 100 метров",
            "Бег на 3000 метров",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько ямочек на среднем мяче для гольфа?",
            "336",
            "215",
            "305",
            "127",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько длился самый длинный розыгрыш очка в истории тенниса?",
            "29 минут",
            "33 минут",
            "27 минут",
            "14 минут",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "На Олимпийских играх 1971 года Надя Команечи стала первой гимнасткой, набравшей высший балл. Какую страну она представляла?",
            "Румыния",
            "Словения",
            "Югославия",
            "Италия",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько медалей завоевал Китай на Олимпийских играх в Пекине?",
            "100",
            "95",
            "98",
            "92",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько игроков в бейсбольной команде?",
            "9",
            "8",
            "7",
            "10",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто был самым молодым игроком, набравшим 10 000 очков в НБА?",
            "Леброн Джеймс",
            "Майкл Джордан",
            "Билл Рассел",
            "Уилт Чемберлен",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько лет было самому молодому профессиональному футболисту?",
            "12",
            "14",
            "16",
            "18",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто выиграл наибольшее количество боев за титул чемпиона мира по боксу в супертяжелом весе?",
            "Джо Луис",
            "Майк Тайсон",
            "Мухаммед Али",
            "Джо Фрейзер",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто самый молодой чемпион мира по боксу в супертяжелом весе?",
            "Майк Тайсон",
            "Джо Луис",
            "Джо Фрейзер",
            "Мухаммед Али",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "О каком боксере из реальной жизни рассказывает классический фильм 1980 года «Бешеный бык»?",
            "О Джейке ЛаМотта",
            "О Джо Луисе",
            "О Джо Фрейзере",
            "О Майке Тайсоне",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Что традиционно пьют победители Indianapolis 500 в кругу победителей?",
            "Молоко",
            "Яблочный сок",
            "Лимонад",
            "Шампанское",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько собак участвует в собачьих бегах?",
            "Шесть",
            "Пять",
            "Семь",
            "Восемь",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько лунок разыгрывается в среднем раунде гольфа?",
            "18",
            "15",
            "12",
            "22",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Насколько велик в метрах бассейн олимпийских размеров?",
            "50 метров в длину и 25 метров в ширину",
            "70 метров в длину и 25 метров в ширину",
            "70 метров в длину и 35 метров в ширину",
            "50 метров в длину и 35 метров в ширину",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "На каких Олимпийских играх Марк Шпиц завоевал семь золотых медалей?",
            "1972 год – Мюнхен",
            "1980 год - Москва",
            "1988 - Сеул",
            "2000 - Сидней",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "В каком виде спорта известный педиатр и писатель Бенджамин Спок выиграл золотую олимпийскую медаль?",
            "Гребля",
            "Бег",
            "Метание молота",
            "Метание копья",
            "Hard"
        )
    )
}