package com.example.data.db

import com.example.common.QuestionInfoDB

object QuestionsForAddToDBService {
    val listOfEasyQuestionsInfoWithIncorrectAnswers = listOf(
        QuestionInfoDB(
            0L,
            "Что надевают на руки в боксе и их две?",
            "Перчатки",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Что используют как тяжесть для зарядки?",
            "Гантелю",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Другое название настольного тенниса – это",
            "Пинг-понг",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Как называют спортивный снаряд-животное?",
            "Козёл",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Что обеспечивает безопасность голове спортсмена?",
            "Шлем",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Как называется бросок в ворота?",
            "Гол",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Кто не играет в хоккей?",
            "Трус",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Доска для спуска со снежного склона называется",
            "Сноуборд",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Атлетика бывает 2 видов. Каких?",
            "Лёгкая и тяжёлая",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Из какого овоща стреляют в спорте?",
            "Из лука",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Чем отбивают мяч в бейсболе?",
            "Битой",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Зачем обливаются холодной водой?",
            "Закаливание",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Чего не надо, если есть сила?",
            "Ума",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Спортивный снаряд для перетягивания",
            "Канат",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Как называется самый центр мишени в стрельбе из лука или дартсе?",
            "Яблочко",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Когда олимпийский спортсмен занимает первое место, медаль какого цвета он получает?",
            "Золото",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Такого наказания нет в хоккее на льду",
            "Конфискация клюшки",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Игрокам запрещено выходить без шлема на",
            "Хоккейное поле",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "В бадминтоне используется",
            "Волан",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Какая шахматная фигура ходит буквой \"Г\"?",
            "Конь",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Каких птиц традиционно выпускают на открытии Олимпийских игр?",
            "Голуби",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        )
    )

    val listOfNormalQuestionsInfoWithIncorrectAnswers = listOf(
        QuestionInfoDB(
            0L,
            "Сколько колец у символа Олимпиады?",
            "5",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Вид спорта, где надо ехать на лыжах и стрелять из винтовки, это",
            "Биатлон",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Эта игра похожа на бейсбол. Какая?",
            "Русская лапта",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Где зажигают олимпийский факел?",
            "В Греции",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Название теннисной площадки",
            "Корт",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Как называется обувь футболиста?",
            "Бутсы",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Водный вид спорта с мячом – это",
            "Водное поло",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Чем забрасывают мяч в гандболе?",
            "Рукой",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "В какой игре пользуются самым легким мячом?",
            "Настольном теннисе",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "В какой игре используются мяч наибольшей величины",
            "Баскетбол",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Начиная с 1924 года к словам «Олимпийские игры» стали добавлять ещё одно то или иное слово. Какое?",
            "Летние или зимние",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Чем награждали победителей Игр в Древней Греции?",
            "Венком из листьев лавра",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "На открытии Олимпийских игр команды идут в порядке алфавита страны-организатора. Но впереди всегда шествует команда одной и той же страны. Какой?",
            "Греции",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Сколько дисциплин в мужской гимнастике?",
            "Шесть – прыжок, кольца, пол, перекладина, брусья, конь",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Какая часть тела в футболе не может касаться мяча?",
            "Руки",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Где проходили первые античные Олимпийские игры?",
            "В Греции",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Самый тяжёлый мяч – это",
            "Баскетбольный",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "В какой стране проходили зимние олимпийские игры в 2014 году?",
            "Россия",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Хоккей с шайбой появился в",
            "Канаде",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Родиной футбола является",
            "Англия",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Олимпиада, символом которой стал Мишка, проходила в Москве в",
            "1980 году",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Шахматы появились в той стране",
            "Индии",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Какой шахматной фигуре можно объявить мат?",
            "Король",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        )
    )

    val listOfHardQuestionsInfoWithIncorrectAnswers = listOf(
        QuestionInfoDB(
            0L,
            "Какой промежуток времени между зимними олимпиадами?",
            "4 года",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Количество игроков в футбольной команде?",
            "11",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какое количество игроков в волейбольной команде?",
            "6",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Что значит эмблема олимпийских игр?",
            "Символ дружбы континентов",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Высокие носки у футболистов называются?",
            "Гетры",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Откуда прыгает лыжник во фристайле?",
            "Трамплин",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Как называется штрафной бросок в хоккее?",
            "Буллит",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Как называется вид спорта, где спортсмены на лыжах делают трюки в воздухе?",
            "Фристайл",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какой девиз у Олимпийских игр?",
            "Быстрее. Выше. Сильнее",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Из какого вида спорта «пелотон»?",
            "Велоспорт",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "В этой стране началось регби. В какой?",
            "Англия",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько весит мяч для гольфа?",
            "41-46 грамм",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Когда основали айкидо?",
            "1925",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Мяч вне игры.",
            "Аут",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Передача мяча в игре.",
            "Пас",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какова длина марафонской дистанции?",
            "42195 метров",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто был основателем современных олимпийских игр?",
            "Французский педагог Пьер де Кубертэн",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какая длина беговой дорожки на спортивном стадионе?",
            "400 метров",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "В каком году прошли 1 зимние Олимпийские игры?",
            "В 1924 году, Шамони, Франция",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какая единственная страна принимала участие во всех чемпионатах мира по футболу?",
            "Бразилия",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Что за гонка Тур де Франс?",
            "Велогонка",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какая африканская страна первой получила право на участие в чемпионате мира?",
            "Египет",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто был первым британским игроком, выигравшим чемпионские титулы в четырех странах?",
            "Дэвид Бекхэм",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Открытый чемпионат Франции по теннису проводится на стадионе, названном в честь какого пилота времен Первой мировой войны?",
            "Ролан Гаррос",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какой город первым дважды принимал Олимпиаду?",
            "Париж",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какое последнее соревнование в десятиборье?",
            "Бег на 1500 метров",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько ямочек на среднем мяче для гольфа?",
            "336",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько длился самый длинный розыгрыш очка в истории тенниса?",
            "29 минут",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "На Олимпийских играх 1971 года Надя Команечи стала первой гимнасткой, набравшей высший балл. Какую страну она представляла?",
            "Румыния",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько медалей завоевал Китай на Олимпийских играх в Пекине?",
            "100",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько игроков в бейсбольной команде?",
            "9",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто был самым молодым игроком, набравшим 10 000 очков в НБА?",
            "Леброн Джеймс",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько лет было самому молодому профессиональному футболисту?",
            "12",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто выиграл наибольшее количество боев за титул чемпиона мира по боксу в супертяжелом весе?",
            "Джо Луис",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто самый молодой чемпион мира по боксу в супертяжелом весе?",
            "Майк Тайсон",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "О каком боксере из реальной жизни рассказывает классический фильм 1980 года «Бешеный бык»?",
            "О Джейке ЛаМотта",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Что традиционно пьют победители Indianapolis 500 в кругу победителей?",
            "Молоко",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько собак участвует в собачьих бегах?",
            "Шесть",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько лунок разыгрывается в среднем раунде гольфа?",
            "18",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Насколько велик в метрах бассейн олимпийских размеров?",
            "50 метров в длину и 25 метров в ширину",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "На каких Олимпийских играх Марк Шпиц завоевал семь золотых медалей?",
            "1972 год – Мюнхен",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "В каком виде спорта известный педиатр и писатель Бенджамин Спок выиграл золотую олимпийскую медаль?",
            "Гребля",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        )
    )



    val listOfEasyQuestionsInfo = listOf(
        QuestionInfoDB(
            0L,
            "Что надевают на руки в боксе и их две?",
            "Перчатки",
            "Варежки",
            "Лосины",
            "Носки",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Что используют как тяжесть для зарядки?",
            "Гантелю",
            "Трёхтомник",
            "Стулья",
            "Пауэрбанку",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Другое название настольного тенниса – это",
            "Пинг-понг",
            "Тик-ток",
            "Тики-так",
            "Walk-talk",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Как называют спортивный снаряд-животное?",
            "Козёл",
            "Баран",
            "Бык",
            "Заяц",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Что обеспечивает безопасность голове спортсмена?",
            "Шлем",
            "Роспись в журнале ТБ",
            "Шапка-ушанка",
            "Мозги",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Как называется бросок в ворота?",
            "Гол",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Кто не играет в хоккей?",
            "Трус",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Доска для спуска со снежного склона называется",
            "Сноуборд",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Атлетика бывает 2 видов. Каких?",
            "Лёгкая и тяжёлая",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Из какого овоща стреляют в спорте?",
            "Из лука",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Чем отбивают мяч в бейсболе?",
            "Битой",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Зачем обливаются холодной водой?",
            "Закаливание",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Чего не надо, если есть сила?",
            "Ума",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Спортивный снаряд для перетягивания",
            "Канат",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Как называется самый центр мишени в стрельбе из лука или дартсе?",
            "Яблочко",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Когда олимпийский спортсмен занимает первое место, медаль какого цвета он получает?",
            "Золото",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Такого наказания нет в хоккее на льду",
            "Конфискация клюшки",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Игрокам запрещено выходить без шлема на",
            "Хоккейное поле",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "В бадминтоне используется",
            "Волан",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Какая шахматная фигура ходит буквой \"Г\"?",
            "Конь",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        ),
        QuestionInfoDB(
            0L,
            "Каких птиц традиционно выпускают на открытии Олимпийских игр?",
            "Голуби",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Easy"
        )
    )

    val listOfNormalQuestionsInfo = listOf(
        QuestionInfoDB(
            0L,
            "Сколько колец у символа Олимпиады?",
            "5",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Вид спорта, где надо ехать на лыжах и стрелять из винтовки, это",
            "Биатлон",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Эта игра похожа на бейсбол. Какая?",
            "Русская лапта",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Где зажигают олимпийский факел?",
            "В Греции",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Название теннисной площадки",
            "Корт",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Как называется обувь футболиста?",
            "Бутсы",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Водный вид спорта с мячом – это",
            "Водное поло",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Чем забрасывают мяч в гандболе?",
            "Рукой",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "В какой игре пользуются самым легким мячом?",
            "Настольном теннисе",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "В какой игре используются мяч наибольшей величины",
            "Баскетбол",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Начиная с 1924 года к словам «Олимпийские игры» стали добавлять ещё одно то или иное слово. Какое?",
            "Летние или зимние",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Чем награждали победителей Игр в Древней Греции?",
            "Венком из листьев лавра",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "На открытии Олимпийских игр команды идут в порядке алфавита страны-организатора. Но впереди всегда шествует команда одной и той же страны. Какой?",
            "Греции",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Сколько дисциплин в мужской гимнастике?",
            "Шесть – прыжок, кольца, пол, перекладина, брусья, конь",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Какая часть тела в футболе не может касаться мяча?",
            "Руки",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Где проходили первые античные Олимпийские игры?",
            "В Греции",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Самый тяжёлый мяч – это",
            "Баскетбольный",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "В какой стране проходили зимние олимпийские игры в 2014 году?",
            "Россия",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Хоккей с шайбой появился в",
            "Канаде",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Родиной футбола является",
            "Англия",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Олимпиада, символом которой стал Мишка, проходила в Москве в",
            "1980 году",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Шахматы появились в той стране",
            "Индии",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        ),
        QuestionInfoDB(
            0L,
            "Какой шахматной фигуре можно объявить мат?",
            "Король",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Normal"
        )
    )

    val listOfHardQuestionsInfo = listOf(
        QuestionInfoDB(
            0L,
            "Какой промежуток времени между зимними олимпиадами?",
            "4 года",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Количество игроков в футбольной команде?",
            "11",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какое количество игроков в волейбольной команде?",
            "6",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Что значит эмблема олимпийских игр?",
            "Символ дружбы континентов",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Высокие носки у футболистов называются?",
            "Гетры",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Откуда прыгает лыжник во фристайле?",
            "Трамплин",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Как называется штрафной бросок в хоккее?",
            "Буллит",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Как называется вид спорта, где спортсмены на лыжах делают трюки в воздухе?",
            "Фристайл",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какой девиз у Олимпийских игр?",
            "Быстрее. Выше. Сильнее",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Из какого вида спорта «пелотон»?",
            "Велоспорт",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "В этой стране началось регби. В какой?",
            "Англия",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько весит мяч для гольфа?",
            "41-46 грамм",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Когда основали айкидо?",
            "1925",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Мяч вне игры.",
            "Аут",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Передача мяча в игре.",
            "Пас",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какова длина марафонской дистанции?",
            "42195 метров",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто был основателем современных олимпийских игр?",
            "Французский педагог Пьер де Кубертэн",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какая длина беговой дорожки на спортивном стадионе?",
            "400 метров",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "В каком году прошли 1 зимние Олимпийские игры?",
            "В 1924 году, Шамони, Франция",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какая единственная страна принимала участие во всех чемпионатах мира по футболу?",
            "Бразилия",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Что за гонка Тур де Франс?",
            "Велогонка",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какая африканская страна первой получила право на участие в чемпионате мира?",
            "Египет",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто был первым британским игроком, выигравшим чемпионские титулы в четырех странах?",
            "Дэвид Бекхэм",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Открытый чемпионат Франции по теннису проводится на стадионе, названном в честь какого пилота времен Первой мировой войны?",
            "Ролан Гаррос",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какой город первым дважды принимал Олимпиаду?",
            "Париж",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Какое последнее соревнование в десятиборье?",
            "Бег на 1500 метров",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько ямочек на среднем мяче для гольфа?",
            "336",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько длился самый длинный розыгрыш очка в истории тенниса?",
            "29 минут",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "На Олимпийских играх 1971 года Надя Команечи стала первой гимнасткой, набравшей высший балл. Какую страну она представляла?",
            "Румыния",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько медалей завоевал Китай на Олимпийских играх в Пекине?",
            "100",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько игроков в бейсбольной команде?",
            "9",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто был самым молодым игроком, набравшим 10 000 очков в НБА?",
            "Леброн Джеймс",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько лет было самому молодому профессиональному футболисту?",
            "12",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто выиграл наибольшее количество боев за титул чемпиона мира по боксу в супертяжелом весе?",
            "Джо Луис",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Кто самый молодой чемпион мира по боксу в супертяжелом весе?",
            "Майк Тайсон",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "О каком боксере из реальной жизни рассказывает классический фильм 1980 года «Бешеный бык»?",
            "О Джейке ЛаМотта",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Что традиционно пьют победители Indianapolis 500 в кругу победителей?",
            "Молоко",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько собак участвует в собачьих бегах?",
            "Шесть",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Сколько лунок разыгрывается в среднем раунде гольфа?",
            "18",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "Насколько велик в метрах бассейн олимпийских размеров?",
            "50 метров в длину и 25 метров в ширину",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "На каких Олимпийских играх Марк Шпиц завоевал семь золотых медалей?",
            "1972 год – Мюнхен",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        ),
        QuestionInfoDB(
            0L,
            "В каком виде спорта известный педиатр и писатель Бенджамин Спок выиграл золотую олимпийскую медаль?",
            "Гребля",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Неправильный_ответ",
            "Hard"
        )
    )
}